# Pandas

## Creating Panda Series

In [2]:
# We import Pandas as pd into Python
import pandas as pd

# We create a Pandas Series that stores a grocery list
groceries = pd.Series(data = [30, 6, 'Yes', 'No'], index = ['eggs', 'apples', 'milk', 'bread'])

# We display the Groceries Pandas Series
groceries

eggs       30
apples      6
milk      Yes
bread      No
dtype: object

In [4]:
# We print some information about Groceries
print('Groceries has shape:', groceries.shape)
print('Groceries has dimension:', groceries.ndim)
print('Groceries has a total of', groceries.size, 'elements')

Groceries has shape: (4,)
Groceries has dimension: 1
Groceries has a total of 4 elements

In [5]:
# We print the index and data of Groceries
print('The data in Groceries is:', groceries.values)
print('The index of Groceries is:', groceries.index)

The data in Groceries is: [30 6 'Yes' 'No']
The index of Groceries is: Index(['eggs', 'apples', 'milk', 'bread'], dtype='object')

In [21]:
# We check whether bananas is a food item (an index) in Groceries
x = 'bananas' in groceries

# We check whether bread is a food item (an index) in Groceries
y = 'bread' in groceries

# We print the results
print('Is bananas an index label in Groceries:', x)
print('Is bread an index label in Groceries:', y)

Is bananas an index label in Groceries: False
Is bread an index label in Groceries: True

## Accessing and Deleting Elements in Pandas Series

In [7]:
# We access elements in Groceries using index labels:

# We use a single index label
print('How many eggs do we need to buy:', groceries['eggs'])
print()

How many eggs do we need to buy: 30

In [8]:
# we can access multiple index labels
print('Do we need milk and bread:\n', groceries[['milk', 'bread']]) 
print()

Do we need milk and bread:
 milk     Yes
bread     No
dtype: object

In [9]:
# we use loc to access multiple index labels
print('How many eggs and apples do we need to buy:\n', groceries.loc[['eggs', 'apples']]) 
print()

How many eggs and apples do we need to buy:
 eggs      30
apples     6
dtype: object

In [11]:
# We access elements in Groceries using numerical indices:

# we use multiple numerical indices
print('How many eggs and apples do we need to buy:\n',  groceries[[0, 1]]) 
print()

How many eggs and apples do we need to buy:
 eggs      30
apples     6
dtype: object

In [12]:
# We use a negative numerical index
print('Do we need bread:\n', groceries[[-1]]) 
print()

Do we need bread:
 bread    No
dtype: object

In [13]:
# We use a single numerical index
print('How many eggs do we need to buy:', groceries[0]) 
print()

How many eggs do we need to buy: 30

In [14]:
# we use iloc to access multiple numerical indices
print('Do we need milk and bread:\n', groceries.iloc[[2, 3]])

Do we need milk and bread:
 milk     Yes
bread     No
dtype: object

## Pandas Series are also mutable like NumPy ndarrays

In [17]:
# We display the original grocery list
print('Original Grocery List:\n', groceries)

Original Grocery List:
 eggs       30
apples      6
milk      Yes
bread      No
dtype: object

In [18]:
# We change the number of eggs to 2
groceries['eggs'] = 2

In [19]:
# We display the changed grocery list
print()
print('Modified Grocery List:\n', groceries)

Modified Grocery List:
 eggs        2
apples      6
milk      Yes
bread      No
dtype: object

In [22]:
# We display the original grocery list
print('Original Grocery List:\n', groceries)

Original Grocery List:
 eggs       30
apples      6
milk      Yes
bread      No
dtype: object

In [23]:
# We remove apples from our grocery list. The drop function removes elements out of place
print()
print('We remove apples (out of place):\n', groceries.drop('apples'))

We remove apples (out of place):
 eggs      30
milk     Yes
bread     No
dtype: object

In [24]:
# When we remove elements out of place the original Series remains intact. To see this
# we display our grocery list again
print()
print('Grocery List after removing apples out of place:\n', groceries)

Grocery List after removing apples out of place:
 eggs       30
apples      6
milk      Yes
bread      No
dtype: object

In [25]:
# We display the original grocery list
print('Original Grocery List:\n', groceries)

Original Grocery List:
 eggs       30
apples      6
milk      Yes
bread      No
dtype: object

In [26]:
# We remove apples from our grocery list in place by setting the inplace keyword to True
groceries.drop('apples', inplace = True)

In [27]:
# When we remove elements in place the original Series its modified. To see this
# we display our grocery list again
print()
print('Grocery List after removing apples in place:\n', groceries)

Grocery List after removing apples in place:
 eggs      30
milk     Yes
bread     No
dtype: object

## Arithmetic Operations on Pandas Series

In [3]:
# We import Pandas as pd into Python
import pandas as pd

# We create a Pandas Series that stores a grocery list of just fruits
fruits= pd.Series(data = [10, 6, 3,], index = ['apples', 'oranges', 'bananas'])

# We display the fruits Pandas Series
fruits

apples     10
oranges     6
bananas     3
dtype: int64

In [4]:
# We print fruits for reference
print('Original grocery list of fruits:\n ', fruits)

# We perform basic element-wise operations using arithmetic symbols
print()
print('fruits + 2:\n', fruits + 2) # We add 2 to each item in fruits
print()
print('fruits - 2:\n', fruits - 2) # We subtract 2 to each item in fruits
print()
print('fruits * 2:\n', fruits * 2) # We multiply each item in fruits by 2 
print()
print('fruits / 2:\n', fruits / 2) # We divide each item in fruits by 2
print()

Original grocery list of fruits:
  apples     10
oranges     6
bananas     3
dtype: int64

fruits + 2:
 apples     12
oranges     8
bananas     5
dtype: int64

fruits - 2:
 apples     8
oranges    4
bananas    1
dtype: int64

fruits * 2:
 apples     20
oranges    12
bananas     6
dtype: int64

fruits / 2:
 apples     5.0
oranges    3.0
bananas    1.5
dtype: float64

In [5]:
# We import NumPy as np to be able to use the mathematical functions
import numpy as np

# We print fruits for reference
print('Original grocery list of fruits:\n', fruits)

# We apply different mathematical functions to all elements of fruits
print()
print('EXP(X) = \n', np.exp(fruits))
print() 
print('SQRT(X) =\n', np.sqrt(fruits))
print()
print('POW(X,2) =\n',np.power(fruits,2)) # We raise all elements of fruits to the power of 2

Original grocery list of fruits:
 apples     10
oranges     6
bananas     3
dtype: int64

EXP(X) =
 apples     22026.465795
oranges      403.428793
bananas       20.085537
dtype: float64

SQRT(X) =
 apples     3.162278
oranges    2.449490
bananas    1.732051
dtype: float64

POW(X,2) =
 apples     100
oranges     36
bananas      9
dtype: int64

In [6]:
# We print fruits for reference
print('Original grocery list of fruits:\n ', fruits)
print()

# We add 2 only to the bananas
print('Amount of bananas + 2 = ', fruits['bananas'] + 2)
print()

# We subtract 2 from apples
print('Amount of apples - 2 = ', fruits.iloc[0] - 2)
print()

# We multiply apples and oranges by 2
print('We double the amount of apples and oranges:\n', fruits[['apples', 'oranges']] * 2)
print()

# We divide apples and oranges by 2
print('We half the amount of apples and oranges:\n', fruits.loc[['apples', 'oranges']] / 2)

Original grocery list of fruits:
  apples     10
oranges     6
bananas     3
dtype: int64

Amount of bananas + 2 =  5

Amount of apples - 2 =  8

We double the amount of apples and oranges:
 apples     20
oranges    12
dtype: int64

We half the amount of apples and oranges:
 apples     5.0
oranges    3.0
dtype: float64

In [8]:
# We create a Pandas Series that stores a grocery list
groceries = pd.Series(data = [30, 6, 'Yes', 'No'], index = ['eggs', 'apples', 'milk', 'bread'])


# We multiply our grocery list by 2
groceries * 2

eggs          60
apples        12
milk      YesYes
bread       NoNo
dtype: object

### Exercise:

In [15]:
import pandas as pd

# Create a Pandas Series that contains the distance of some planets from the Sun.
# Use the name of the planets as the index to your Pandas Series, and the distance
# from the Sun as your data. The distance from the Sun is in units of 10^6 km

distance_from_sun = [149.6, 1433.5, 227.9, 108.2, 778.6]

planets = ['Earth','Saturn', 'Mars','Venus', 'Jupiter']

Earth     8.311111
Mars     12.661111
Venus     6.011111
dtype: float64

In [16]:
# Create a Pandas Series using the above data, with the name of the planets as
# the index and the distance from the Sun as your data.
dist_planets = pd.Series(data = distance_from_sun, index = planets)
dist_planets

Earth       149.6
Saturn     1433.5
Mars        227.9
Venus       108.2
Jupiter     778.6
dtype: float64

In [17]:
# Calculate the number of minutes it takes sunlight to reach each planet. You can
# do this by dividing the distance from the Sun for each planet by the speed of light.
# Since in the data above the distance from the Sun is in units of 10^6 km, you can
# use a value for the speed of light of c = 18, since light travels 18 x 10^6 km/minute.
time_light = dist_planets / 18
time_light

Earth       8.311111
Saturn     79.638889
Mars       12.661111
Venus       6.011111
Jupiter    43.255556
dtype: float64

In [18]:
# Use Boolean indexing to select only those planets for which sunlight takes less
# than 40 minutes to reach them.
close_planets = time_light[time_light < 40]
close_planets

Earth     8.311111
Mars     12.661111
Venus     6.011111
dtype: float64

## Creating Pandas DataFrames

Pandas DataFrames are two-dimensional data structures with labeled rows and columns, that can hold many data types.

In [19]:
# We import Pandas as pd into Python
import pandas as pd

# We create a dictionary of Pandas Series 
items = {'Bob' : pd.Series(data = [245, 25, 55], index = ['bike', 'pants', 'watch']),
         'Alice' : pd.Series(data = [40, 110, 500, 45], index = ['book', 'glasses', 'bike', 'pants'])}

# We print the type of items to see that it is a dictionary
print(type(items))

<class 'dict'>

In [20]:
# We create a Pandas DataFrame by passing it a dictionary of Pandas Series
shopping_carts = pd.DataFrame(items)

# We display the DataFrame
shopping_carts

           Bob  Alice
bike     245.0  500.0
book       NaN   40.0
glasses    NaN  110.0
pants     25.0   45.0
watch     55.0    NaN

In [21]:
# We create a dictionary of Pandas Series without indexes
data = {'Bob' : pd.Series([245, 25, 55]),
        'Alice' : pd.Series([40, 110, 500, 45])}

# We create a DataFrame
df = pd.DataFrame(data)

# We display the DataFrame
df

     Bob  Alice
0  245.0     40
1   25.0    110
2   55.0    500
3    NaN     45

Pandas indexes the rows of the DataFrame starting from 0, just like NumPy indexes ndarrays.

In [22]:
# We print some information about shopping_carts
print('shopping_carts has shape:', shopping_carts.shape)
print('shopping_carts has dimension:', shopping_carts.ndim)
print('shopping_carts has a total of:', shopping_carts.size, 'elements')
print()
print('The data in shopping_carts is:\n', shopping_carts.values)
print()
print('The row index in shopping_carts is:', shopping_carts.index)
print()
print('The column index in shopping_carts is:', shopping_carts.columns)

shopping_carts has shape: (5, 2)
shopping_carts has dimension: 2
shopping_carts has a total of: 10 elements

The data in shopping_carts is:
 [[245. 500.]
 [ nan  40.]
 [ nan 110.]
 [ 25.  45.]
 [ 55.  nan]]

The row index in shopping_carts is: Index(['bike', 'book', 'glasses', 'pants', 'watch'], dtype='object')

The column index in shopping_carts is: Index(['Bob', 'Alice'], dtype='object')

Pandas allows us to select __which data__ we want to put into our DataFrame by means of the __keywords__ columns and __index__

In [23]:
# We Create a DataFrame that only has Bob's data
bob_shopping_cart = pd.DataFrame(items, columns=['Bob'])

# We display bob_shopping_cart
bob_shopping_cart

       Bob
bike   245
pants   25
watch   55

In [24]:
# We Create a DataFrame that only has selected items for both Alice and Bob
sel_shopping_cart = pd.DataFrame(items, index = ['pants', 'book'])

# We display sel_shopping_cart
sel_shopping_cart

        Bob  Alice
pants  25.0     45
book    NaN     40

In [25]:
# We Create a DataFrame that only has selected items for Alice
alice_sel_shopping_cart = pd.DataFrame(items, index = ['glasses', 'bike'], columns = ['Alice'])

# We display alice_sel_shopping_cart
alice_sel_shopping_cart

         Alice
glasses    110
bike       500

In [26]:
# We create a dictionary of lists (arrays)
data = {'Integers' : [1,2,3],
        'Floats' : [4.5, 8.2, 9.6]}

# We create a DataFrame 
df = pd.DataFrame(data)

# We display the DataFrame
df

   Integers  Floats
0         1     4.5
1         2     8.2
2         3     9.6

In [27]:
# We create a dictionary of lists (arrays)
data = {'Integers' : [1,2,3],
        'Floats' : [4.5, 8.2, 9.6]}

# We create a DataFrame and provide the row index
df = pd.DataFrame(data, index = ['label 1', 'label 2', 'label 3'])

# We display the DataFrame
df

         Integers  Floats
label 1         1     4.5
label 2         2     8.2
label 3         3     9.6

In [28]:
# We create a list of Python dictionaries
items2 = [{'bikes': 20, 'pants': 30, 'watches': 35}, 
          {'watches': 10, 'glasses': 50, 'bikes': 15, 'pants':5}]

# We create a DataFrame 
store_items = pd.DataFrame(items2)

# We display the DataFrame
store_items

   bikes  glasses  pants  watches
0     20      NaN     30       35
1     15     50.0      5       10

In [29]:
# We create a list of Python dictionaries
items2 = [{'bikes': 20, 'pants': 30, 'watches': 35}, 
          {'watches': 10, 'glasses': 50, 'bikes': 15, 'pants':5}]

# We create a DataFrame  and provide the row index
store_items = pd.DataFrame(items2, index = ['store 1', 'store 2'])

# We display the DataFrame
store_items

         bikes  glasses  pants  watches
store 1     20      NaN     30       35
store 2     15     50.0      5       10

## Accessing Elements in Pandas DataFrames

In [30]:
# We print the store_items DataFrame
print(store_items)

# We access rows, columns and elements using labels
print()
print('How many bikes are in each store:\n', store_items[['bikes']])
print()
print('How many bikes and pants are in each store:\n', store_items[['bikes', 'pants']])
print()
print('What items are in Store 1:\n', store_items.loc[['store 1']])
print()
print('How many bikes are in Store 2:', store_items['bikes']['store 2'])

         bikes  glasses  pants  watches
store 1     20      NaN     30       35
store 2     15     50.0      5       10

How many bikes are in each store:
          bikes
store 1     20
store 2     15

How many bikes and pants are in each store:
          bikes  pants
store 1     20     30
store 2     15      5

What items are in Store 1:
          bikes  glasses  pants  watches
store 1     20      NaN     30       35

How many bikes are in Store 2: 15

We can also modify our DataFrames by adding rows or columns

In [31]:
# We add a new column named shirts to our store_items DataFrame indicating the number of
# shirts in stock at each store. We will put 15 shirts in store 1 and 2 shirts in store 2
store_items['shirts'] = [15,2]

# We display the modified DataFrame
store_items

         bikes  glasses  pants  watches  shirts
store 1     20      NaN     30       35      15
store 2     15     50.0      5       10       2

We can also add new columns to our DataFrame by using arithmetic operations between other columns in our DataFrame

In [32]:
# We make a new column called suits by adding the number of shirts and pants
store_items['suits'] = store_items['pants'] + store_items['shirts']

# We display the modified DataFrame
store_items

         bikes  glasses  pants  watches  shirts  suits
store 1     20      NaN     30       35      15     45
store 2     15     50.0      5       10       2      7

To add rows to our DataFrame we first have to create a new Dataframe and then append it to the original DataFrame

In [33]:
# We create a dictionary from a list of Python dictionaries that will number of items at the new store
new_items = [{'bikes': 20, 'pants': 30, 'watches': 35, 'glasses': 4}]

# We create new DataFrame with the new_items and provide and index labeled store 3
new_store = pd.DataFrame(new_items, index = ['store 3'])

# We display the items at the new store
new_store

         bikes  glasses  pants  watches
store 3     20        4     30       35

In [34]:
# We append store 3 to our store_items DataFrame
store_items = store_items.append(new_store)

# We display the modified DataFrame
store_items

/anaconda3/lib/python3.7/site-packages/pandas/core/frame.py:6211: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  sort=sort)

         bikes  glasses  pants  shirts  suits  watches
store 1     20      NaN     30    15.0   45.0       35
store 2     15     50.0      5     2.0    7.0       10
store 3     20      4.0     30     NaN    NaN       35

In [35]:
# We add a new column using data from particular rows in the watches column
store_items['new watches'] = store_items['watches'][1:]

# We display the modified DataFrame
store_items

         bikes  glasses  pants  shirts  suits  watches  new watches
store 1     20      NaN     30    15.0   45.0       35          NaN
store 2     15     50.0      5     2.0    7.0       10         10.0
store 3     20      4.0     30     NaN    NaN       35         35.0

It is also possible, to insert new columns into the DataFrames anywhere we want. The ***dataframe.inseThe rt(loc,label,data)*** method allows us to insert a new column in the dataframe at location __loc__, with the given column ___label___, and given ___data___

In [36]:
# We insert a new column with label shoes right before the column with numerical index 4
store_items.insert(4, 'shoes', [8,5,0])

# we display the modified DataFrame
store_items

         bikes  glasses  pants  shirts  shoes  suits  watches  new watches
store 1     20      NaN     30    15.0      8   45.0       35          NaN
store 2     15     50.0      5     2.0      5    7.0       10         10.0
store 3     20      4.0     30     NaN      0    NaN       35         35.0

To delete rows and columns from our DataFrame we will use the ___.pop()___ and ___.drop()___ methods.

In [37]:
# We remove the new watches column
store_items.pop('new watches')

# we display the modified DataFrame
store_items

         bikes  glasses  pants  shirts  shoes  suits  watches
store 1     20      NaN     30    15.0      8   45.0       35
store 2     15     50.0      5     2.0      5    7.0       10
store 3     20      4.0     30     NaN      0    NaN       35

In [38]:
# We remove the watches and shoes columns
store_items = store_items.drop(['watches', 'shoes'], axis = 1)

# we display the modified DataFrame
store_items

         bikes  glasses  pants  shirts  suits
store 1     20      NaN     30    15.0   45.0
store 2     15     50.0      5     2.0    7.0
store 3     20      4.0     30     NaN    NaN

In [39]:
# We remove the store 2 and store 1 rows
store_items = store_items.drop(['store 2', 'store 1'], axis = 0)

# we display the modified DataFrame
store_items

         bikes  glasses  pants  shirts  suits
store 3     20      4.0     30     NaN    NaN

In [40]:
# We change the column label bikes to hats
store_items = store_items.rename(columns = {'bikes': 'hats'})

# we display the modified DataFrame
store_items

         hats  glasses  pants  shirts  suits
store 3    20      4.0     30     NaN    NaN

In [41]:
# We change the row label from store 3 to last store
store_items = store_items.rename(index = {'store 3': 'last store'})

# we display the modified DataFrame
store_items

            hats  glasses  pants  shirts  suits
last store    20      4.0     30     NaN    NaN

In [42]:
# We change the row index to be the data in the pants column
store_items = store_items.set_index('pants')

# we display the modified DataFrame
store_items

       hats  glasses  shirts  suits
pants
30       20      4.0     NaN    NaN

## Dealing with NaN

Before we can begin training our learning algorithms with large datasets, we usually need to clean the data first. This means we need to have a method for detecting and correcting errors in our data.

In [43]:
# We create a list of Python dictionaries
items2 = [{'bikes': 20, 'pants': 30, 'watches': 35, 'shirts': 15, 'shoes':8, 'suits':45},
{'watches': 10, 'glasses': 50, 'bikes': 15, 'pants':5, 'shirts': 2, 'shoes':5, 'suits':7},
{'bikes': 20, 'pants': 30, 'watches': 35, 'glasses': 4, 'shoes':10}]

# We create a DataFrame  and provide the row index
store_items = pd.DataFrame(items2, index = ['store 1', 'store 2', 'store 3'])

# We display the DataFrame
store_items

         bikes  glasses  pants  shirts  shoes  suits  watches
store 1     20      NaN     30    15.0      8   45.0       35
store 2     15     50.0      5     2.0      5    7.0       10
store 3     20      4.0     30     NaN     10    NaN       35

In [44]:
# We count the number of NaN values in store_items
x =  store_items.isnull().sum().sum()

# We print x
print('Number of NaN values in our DataFrame:', x)

Number of NaN values in our DataFrame: 3

In [45]:
store_items.isnull()

         bikes  glasses  pants  shirts  shoes  suits  watches
store 1  False     True  False   False  False  False    False
store 2  False    False  False   False  False  False    False
store 3  False    False  False    True  False   True    False

In [46]:
store_items.isnull().sum()

bikes      0
glasses    1
pants      0
shirts     1
shoes      0
suits      1
watches    0
dtype: int64

The second sum will then add up the 1s in the above Pandas Series.

In [47]:
# We print the number of non-NaN values in our DataFrame
print()
print('Number of non-NaN values in the columns of our DataFrame:\n', store_items.count())

Number of non-NaN values in the columns of our DataFrame:
 bikes      3
glasses    2
pants      3
shirts     2
shoes      3
suits      2
watches    3
dtype: int64

#### Now that we learned how to know if our dataset has any NaN values in it, the next step is to decide what to do with them. In general we have two options, we can either delete or replace the NaN values.

In [48]:
# We drop any rows with NaN values
store_items.dropna(axis = 0)

         bikes  glasses  pants  shirts  shoes  suits  watches
store 2     15     50.0      5     2.0      5    7.0       10

In [49]:
# We drop any columns with NaN values
store_items.dropna(axis = 1)

         bikes  pants  shoes  watches
store 1     20     30      8       35
store 2     15      5      5       10
store 3     20     30     10       35

In [51]:
# We replace all NaN values with 0
store_items.fillna(0)

         bikes  glasses  pants  shirts  shoes  suits  watches
store 1     20      0.0     30    15.0      8   45.0       35
store 2     15     50.0      5     2.0      5    7.0       10
store 3     20      4.0     30     0.0     10    0.0       35

In [52]:
# We replace NaN values with the previous value in the column
store_items.fillna(method = 'ffill', axis = 0)

         bikes  glasses  pants  shirts  shoes  suits  watches
store 1     20      NaN     30    15.0      8   45.0       35
store 2     15     50.0      5     2.0      5    7.0       10
store 3     20      4.0     30     2.0     10    7.0       35

In [53]:
# We replace NaN values with the previous value in the row
store_items.fillna(method = 'ffill', axis = 1)

         bikes  glasses  pants  shirts  shoes  suits  watches
store 1   20.0     20.0   30.0    15.0    8.0   45.0     35.0
store 2   15.0     50.0    5.0     2.0    5.0    7.0     10.0
store 3   20.0      4.0   30.0    30.0   10.0   10.0     35.0

In [54]:
# We replace NaN values with the next value in the column
store_items.fillna(method = 'backfill', axis = 0)

         bikes  glasses  pants  shirts  shoes  suits  watches
store 1     20     50.0     30    15.0      8   45.0       35
store 2     15     50.0      5     2.0      5    7.0       10
store 3     20      4.0     30     NaN     10    NaN       35

In [55]:
# We replace NaN values with the next value in the row
store_items.fillna(method = 'backfill', axis = 1)

         bikes  glasses  pants  shirts  shoes  suits  watches
store 1   20.0     30.0   30.0    15.0    8.0   45.0     35.0
store 2   15.0     50.0    5.0     2.0    5.0    7.0     10.0
store 3   20.0      4.0   30.0    10.0   10.0   35.0     35.0

In [56]:
# We replace NaN values by using linear interpolation using column values
store_items.interpolate(method = 'linear', axis = 0)

         bikes  glasses  pants  shirts  shoes  suits  watches
store 1     20      NaN     30    15.0      8   45.0       35
store 2     15     50.0      5     2.0      5    7.0       10
store 3     20      4.0     30     2.0     10    7.0       35

In [57]:
# We replace NaN values by using linear interpolation using row values
store_items.interpolate(method = 'linear', axis = 1)

         bikes  glasses  pants  shirts  shoes  suits  watches
store 1   20.0     25.0   30.0    15.0    8.0   45.0     35.0
store 2   15.0     50.0    5.0     2.0    5.0    7.0     10.0
store 3   20.0      4.0   30.0    20.0   10.0   22.5     35.0

## Loading Data into a Pandas DataFrame

In [3]:
# We load Google stock data in a DataFrame
Google_stock = pd.read_csv('data/goog.csv')

# We print some information about Google_stock
print('Google_stock is of type:', type(Google_stock))
print('Google_stock has shape:', Google_stock.shape)

Google_stock is of type: <class 'pandas.core.frame.DataFrame'>
Google_stock has shape: (1258, 8)

In [59]:
Google_stock

       Sym       Date    Open    High     Low   Close    Volume  Adj Close
0     GOOG   4/7/2010  567.30  568.75  561.86  563.54   2581000     563.54
1     GOOG   4/6/2010  569.46  570.89  565.40  568.22   2060100     568.22
2     GOOG   4/5/2010  570.90  574.88  569.00  571.01   1901500     571.01
3     GOOG   4/1/2010  571.35  573.45  565.55  568.80   2102700     568.80
4     GOOG  3/31/2010  565.05  569.74  562.81  567.12   3030800     567.12
5     GOOG  3/30/2010  562.83  567.63  560.28  566.71   1977900     566.71
6     GOOG  3/29/2010  563.00  564.72  560.57  562.45   3104500     562.45
7     GOOG  3/26/2010  565.27  567.39  560.02  562.69   2696200     562.69
8     GOOG  3/25/2010  559.02  572.00  558.66  562.88   3930900     562.88
9     GOOG  3/24/2010  545.51  559.85  539.70  557.33   6565200     557.33
10    GOOG  3/23/2010  557.04  558.31  542.00  549.00   5501300     549.00
11    GOOG  3/22/2010  556.11  566.85  554.28  557.50   4004800     557.50
12    GOOG  3/19/2010  566.23  568.00  557.28  560.00   4792400     560.00
13    GOOG  3/18/2010  564.72  568.44  562.96  566.40   1777200     566.40
14    GOOG  3/17/2010  568.30  571.45  564.25  565.56   3321600     565.56
15    GOOG  3/16/2010  561.83  568.42  560.76  565.20   3431500     565.20
16    GOOG  3/15/2010  566.68  569.45  556.00  563.18   4653900     563.18
17    GOOG  3/12/2010  588.14  588.28  579.16  579.54   2753400     579.54
18    GOOG  3/11/2010  574.26  586.21  574.20  581.14   4233300     581.14
19    GOOG  3/10/2010  563.76  578.50  562.21  576.45   5654900     576.45
20    GOOG   3/9/2010  559.85  564.66  556.50  560.19   3176600     560.19
21    GOOG   3/8/2010  564.78  565.18  561.01  562.48   2386400     562.48
22    GOOG   3/5/2010  561.35  567.67  559.90  564.21   3912200     564.21
23    GOOG   3/4/2010  546.50  556.13  546.20  554.59   3183800     554.59
24    GOOG   3/3/2010  542.36  548.12  539.25  545.32   3089400     545.32
25    GOOG   3/2/2010  535.48  545.66  535.01  541.06   4356800     541.06
26    GOOG   3/1/2010  529.20  533.29  527.74  532.69   2237900     532.69
27    GOOG  2/26/2010  527.42  531.75  523.48  526.80   2049300     526.80
28    GOOG  2/25/2010  527.12  528.49  520.00  526.43   3309200     526.43
29    GOOG  2/24/2010  533.98  538.44  530.51  531.47   2326600     531.47
...    ...        ...     ...     ...     ...     ...       ...        ...
1228  GOOG  5/19/2005  240.34  241.17  238.27  239.18   9716500     239.18
1229  GOOG  5/18/2005  233.61  239.97  233.52  239.16  12312000     239.16
1230  GOOG  5/17/2005  230.56  233.45  230.20  233.13   7808900     233.13
1231  GOOG  5/16/2005  229.68  231.62  228.57  231.05   5681400     231.05
1232  GOOG  5/13/2005  229.18  231.09  227.32  229.24   7415500     229.24
1233  GOOG  5/12/2005  230.81  232.23  228.20  228.72   8948200     228.72
1234  GOOG  5/11/2005  228.97  231.98  227.93  231.29  11478800     231.29
1235  GOOG  5/10/2005  225.47  227.80  224.72  227.80   6345800     227.80
1236  GOOG   5/9/2005  228.00  228.50  225.43  226.02   5536800     226.02
1237  GOOG   5/6/2005  228.40  229.25  226.47  228.02   6763900     228.02
1238  GOOG   5/5/2005  228.62  228.62  225.88  226.98   7509600     226.98
1239  GOOG   5/4/2005  227.23  229.88  227.00  228.50  12083500     228.50
1240  GOOG   5/3/2005  221.85  228.15  221.32  226.19  17780200     226.19
1241  GOOG   5/2/2005  222.05  223.70  220.21  222.29   9767400     222.29
1242  GOOG  4/29/2005  221.91  222.25  217.82  220.00   9170200     220.00
1243  GOOG  4/28/2005  219.50  222.08  217.71  219.45   8682800     219.45
1244  GOOG  4/27/2005  217.99  220.85  216.74  219.78  10264800     219.78
1245  GOOG  4/26/2005  220.22  222.00  218.29  218.75  17272000     218.75
1246  GOOG  4/25/2005  217.82  224.74  217.52  223.53  19840000     223.53
1247  GOOG  4/22/2005  222.90  224.00  214.26  215.81  33205100     215.81
1248  GOOG  4/21/2005  200.42  205.00  199.32  204.22  17751900     204.22
1249  GOOG  4/20/2005  198.58  200.50  195.91  198.10  15451500     198.10
1250  GOOG  4/19/2005  189.33  192.00  188.03  191.40   8430000     191.40
1251  GOOG  4/18/2005  184.58  187.88  183.49  186.97   6550300     186.97
1252  GOOG  4/15/2005  190.10  190.34  184.66  185.00  11577400     185.00
1253  GOOG  4/14/2005  193.27  194.36  190.10  191.45   6152700     191.45
1254  GOOG  4/13/2005  193.47  194.32  189.73  192.93   6555800     192.93
1255  GOOG  4/12/2005  193.00  194.42  189.41  193.96   7319600     193.96
1256  GOOG  4/11/2005  193.09  194.80  192.32  193.23   5410500     193.23
1257  GOOG   4/8/2005  193.69  195.10  191.45  192.05   5116600     192.05

[1258 rows x 8 columns]

When dealing with large datasets like this one, it is often useful just to take a look at the first few rows of data instead of the whole dataset

In [62]:
Google_stock.head()

    Sym       Date    Open    High     Low   Close   Volume  Adj Close
0  GOOG   4/7/2010  567.30  568.75  561.86  563.54  2581000     563.54
1  GOOG   4/6/2010  569.46  570.89  565.40  568.22  2060100     568.22
2  GOOG   4/5/2010  570.90  574.88  569.00  571.01  1901500     571.01
3  GOOG   4/1/2010  571.35  573.45  565.55  568.80  2102700     568.80
4  GOOG  3/31/2010  565.05  569.74  562.81  567.12  3030800     567.12

We can also optionally use .head(N) or .tail(N) to display the first and last N rows of data, respectively.

In [63]:
Google_stock.isnull().any()

Sym          False
Date         False
Open         False
High         False
Low          False
Close        False
Volume       False
Adj Close    False
dtype: bool

In [64]:
# We get descriptive statistics on our stock data
Google_stock.describe()

,Open,High,Low,Close,Volume,Adj Close
count,1258.000000,1258.000000,1258.000000,1258.000000,1.258000e+03,1258.000000
mean,446.004921,451.368219,440.065882,445.695779,6.492043e+06,445.695779
std,107.252863,107.588823,106.320282,106.916954,4.485054e+06,106.916954
min,184.580000,187.880000,183.490000,185.000000,8.587000e+05,185.000000
25%,374.730000,380.707500,369.230000,374.260000,3.636450e+06,374.260000
50%,447.580000,453.330000,441.910000,445.915000,5.473650e+06,445.915000
75%,519.257500,523.595000,513.030000,517.952500,7.887375e+06,517.952500
max,741.130000,747.240000,725.000000,741.790000,4.111670e+07,741.790000

In [66]:
# We get descriptive statistics on a single column of our DataFrame
Google_stock['Adj Close'].describe()

count    1258.000000
mean      445.695779
std       106.916954
min       185.000000
25%       374.260000
50%       445.915000
75%       517.952500
max       741.790000
Name: Adj Close, dtype: float64

In [67]:
# We print information about our DataFrame  
print()
print('Maximum values of each column:\n', Google_stock.max())
print()
print('Minimum Close value:', Google_stock['Close'].min())
print()
print('Average value of each column:\n', Google_stock.mean())

Maximum values of each column:
 Sym              GOOG
Date         9/9/2009
Open           741.13
High           747.24
Low               725
Close          741.79
Volume       41116700
Adj Close      741.79
dtype: object

Minimum Close value: 185.0

Average value of each column:
 Sym          1.000000e+00
Date         3.542892e-01
Open         8.498963e-02
High         1.470588e-01
Low          2.975040e-01
Close        3.544634e-01
Volume       6.492043e+06
Adj Close    4.456958e+02
dtype: float64

In [72]:
# We display the correlation between columns
Google_stock.corr()

               Open      High       Low     Close    Volume  Adj Close
Open       1.000000  0.998883  0.998366  0.997280 -0.339888   0.997280
High       0.998883  1.000000  0.998048  0.998610 -0.331654   0.998610
Low        0.998366  0.998048  1.000000  0.998825 -0.357460   0.998825
Close      0.997280  0.998610  0.998825  1.000000 -0.344796   1.000000
Volume    -0.339888 -0.331654 -0.357460 -0.344796  1.000000  -0.344796
Adj Close  0.997280  0.998610  0.998825  1.000000 -0.344796   1.000000

Grouping data with .groupby() method. The .groupby() method allows us to group data in different ways.

In [5]:
# We load fake Company data in a DataFrame
data = pd.read_csv('data/fake_company.csv')

data

   Year     Name Department  Age  Salary\t
0  1990    Alice         HR   25     50000
1  1990      Bob         RD   30     48000
2  1990  Charlie      Admin   45     55000
3  1991    Alice         HR   26     52000
4  1991      Bob         RD   31     50000
5  1991  Charlie      Admin   46     60000
6  1992    Alice         HR   27     60000
7  1992      Bob         RD   32     52000
8  1992  Charlie      Admin   47     62000

In [11]:
# We display the total amount of money spent in salaries each year
data.groupby(['Year'])['Salary'].sum()

KeyError: 'Column not found: 0'

In [76]:
# We display the average salary per year
data.groupby(['Year'])['Salary'].mean()

KeyError: 'Column not found: Salary'

In [77]:
# We display the salary distribution per department per year.
data.groupby(['Year', 'Department'])['Salary'].sum()

KeyError: 'Column not found: Salary'

In [4]:
# We display the average salary per year
data.groupby(['Year'])['Salary'].mean()

NameError: name 'data' is not defined

In [81]:
# We display the total salary each employee received in all the years they worked for the company
data.groupby(['Name'])['Salary'].sum()

KeyError: 'Column not found: Salary'

In [82]:
# We display the salary distribution per department per year.
data.groupby(['Year', 'Department'])['Salary'].sum()

KeyError: 'Column not found: Salary'